app_template/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.save do |result|
---
INSERT INTO `users` (`updated_at`, `crypted_password`, `current_login_ip`, `username`, `password_salt`, `persistence_token`, `email`, `last_login_ip`, `created_at`) VALUES('2009-07-24 20:08:42', '7ae7014de9238449850ae0d79ec53ffc0e30b01538d50ecf96276839f95219078ebb331c31920d35a904be99ab013b5ca312ddbcd9ce942de1d60440160010c6', '127.0.0.1', 'casen', 'nVqDgxPeGUkIL3LTG7-F', '383bcfa0e69c5fb098b5c9821f0e786474dc2ded4796fa2ef7a434a221aa1f450d098e7a0b80d2fd7565c7b6f3d22d70ef15ba15a305b4a873f89b454aa403f1', 'iamcasen@gmail.com', NULL, '2009-07-24 20:08:42')